---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.TotalPathLength
source: html/86172dca-bba2-2f16-5b0c-1324646c77da.htm
---
# Autodesk.Revit.DB.DividedPath.TotalPathLength Property

The sum of the curve lengths.

## Syntax (C#)
```csharp
public double TotalPathLength { get; }
```